app/Controllers/Jobs/JobsController.php

INSERT INTO `searches` (`keyword`) VALUES ('developer')
---
    public function searchingForJobs() {


        $jobs = new Job();



        $searches = new Search();

        $data = [

            "keyword" => $this->request->getPost('title'),

        ];


        $searches->save($data);